darreneckert/THQ_HOTAS/hardware/THQRightThrottleI2C/avr/boards.txt
THQRightThrottleI2C.name=THQRightThrottleI2C
THQRightThrottleI2C.vid.0=0x1B4F
THQRightThrottleI2C.pid.0=0x9207
THQRightThrottleI2C.vid.1=0x1B4F
THQRightThrottleI2C.pid.1=0x9208
THQRightThrottleI2C.upload_port.0.vid=0x1B4F
THQRightThrottleI2C.upload_port.0.pid=0x9207
THQRightThrottleI2C.upload_port.1.vid=0x1B4F
THQRightThrottleI2C.upload_port.1.pid=0x9208
THQRightThrottleI2C.upload_port.2.board=LilyPadUSB

THQRightThrottleI2C.upload.tool=avrdude
THQRightThrottleI2C.upload.tool.default=avrdude
THQRightThrottleI2C.upload.tool.network=arduino_ota
THQRightThrottleI2C.upload.protocol=avr109
THQRightThrottleI2C.upload.maximum_size=28672
THQRightThrottleI2C.upload.maximum_data_size=2560
THQRightThrottleI2C.upload.speed=57600
THQRightThrottleI2C.upload.disable_flushing=true
THQRightThrottleI2C.upload.use_1200bps_touch=true
THQRightThrottleI2C.upload.wait_for_upload_port=true

THQRightThrottleI2C.bootloader.tool=avrdude
THQRightThrottleI2C.bootloader.tool.default=avrdude
THQRightThrottleI2C.bootloader.low_fuses=0xff
THQRightThrottleI2C.bootloader.high_fuses=0xd8
THQRightThrottleI2C.bootloader.extended_fuses=0xce
THQRightThrottleI2C.bootloader.file=caterina-LilyPadUSB/Caterina-LilyPadUSB.hex
THQRightThrottleI2C.bootloader.unlock_bits=0x3F
THQRightThrottleI2C.bootloader.lock_bits=0x2F

THQRightThrottleI2C.build.mcu=atmega32u4
THQRightThrottleI2C.build.f_cpu=8000000L
THQRightThrottleI2C.build.vid=0x1B4F
THQRightThrottleI2C.build.pid=0x9208
THQRightThrottleI2C.build.usb_product="THQRightTHrottleI2C"
THQRightThrottleI2C.build.board=AVR_LILYPAD_USB
THQRightThrottleI2C.build.core=arduino
THQRightThrottleI2C.build.variant=leonardo
THQRightThrottleI2C.build.extra_flags={build.usb_flags}
